Catalogs/Туры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Туры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Туры/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если НЕ Данные.ПометкаУдаления Тогда
		СтандартнаяОбработка = Ложь;
		Представление = СтрШаблон(Данные.Наименование + " %1", Данные.Владелец);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    Поля.Добавить("ПометкаУдаления");
    Поля.Добавить("Наименование");
    Поля.Добавить("Владелец");
КонецПроцедуры

Функция ТурНайти(Код, Чемпионат)
	Возврат СерверныйФункции.ТурНайти(Код, Чемпионат);
КонецФункции

Функция ТурСоздатьЭлемент(Искать)
	Если Искать Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Туры.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Туры КАК Туры
		                      |ГДЕ
		                      |	Туры.ПометкаУдаления = ИСТИНА
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Ссылка");
		Запрос.Выполнить().Выбрать();
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Объект	= Выборка.Ссылка.ПолучитьОбъект();
			Объект.УстановитьПометкуУдаления(Ложь);
			ЗаполнитьЗначенияСвойств(Объект, Новый Структура("Код,Наименование,Владелец,ДатаНачала,ДатаОкончания,ОлимпийскаяСистема,Комментарий,Изображение"));
			Возврат Объект;
		КонецЕсли;
		Искать = Ложь;
	КонецЕсли;
	Возврат Справочники.Туры.СоздатьЭлемент();
КонецФункции

Функция Заполнить(Чемпионат) Экспорт
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Возврат Ложь;
	ИначеЕсли Чемпионат.Владелец.ОлимпийскаяСистема Тогда
		Возврат Ложь;
	КонецЕсли;
	Искать	= Истина;
	Объект	= Неопределено;
	Для Итератор = 1 По КоличествоМакс(Чемпионат.Команды.Количество()) Цикл
		Тур		= ТурНайти(Итератор, Чемпионат);
		Если ЗначениеЗаполнено(Тур) Тогда
			Объект	= Тур.ПолучитьОбъект();
			Если Тур.ПометкаУдаления Тогда
				Объект.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
			ОбщегоНазначения.УстановитьЗначение(Объект.Код, Итератор);
			ОбщегоНазначения.УстановитьЗначение(Объект.Наименование, Объект.НаименованиеПолучить());
			ОбщегоНазначения.УстановитьЗначение(Объект.ДатаНачала, Чемпионат.ДатаНачала);
			ОбщегоНазначения.УстановитьЗначение(Объект.ДатаОкончания, Чемпионат.ДатаОкончания);
			Если Объект.Модифицированность() Тогда
				Объект.Записать();
			КонецЕсли;
		Иначе
			Объект	= ТурСоздатьЭлемент(Искать);
			ЗаполнитьЗначенияСвойств(Объект, Новый Структура("Код,Владелец,ДатаНачала,ДатаОкончания", Итератор, Чемпионат, Чемпионат.ДатаНачала, Чемпионат.ДатаОкончания));
			Объект.Наименование	= Объект.НаименованиеПолучить();
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	Возврат (Объект <> Неопределено);
КонецФункции

Функция ДатыУстановить(Ссылка) Экспорт
	Ответ = Ложь;
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Туры") Тогда
		Попытка
			Объект	= Ссылка.ПолучитьОбъект();
			Объект.ДатыУстановить(Объект);
			Если Объект.Модифицированность() Тогда
				Объект.Записать();
			КонецЕсли;
			Ответ = Истина;
		Исключение
			СерверныйФункции.Логировать("Справочники.Туры.ДатыУстановить", ОписаниеОшибки(), Ссылка);
		КонецПопытки;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Туры = СерверныйФункции.ТурыЧемпионата(Ссылка);
		Для Каждого Элемент Из Туры Цикл
			Ответ = Макс(Ответ, ДатыУстановить(Элемент));
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция КоличествоМакс(Количество) Экспорт
	Возврат ?(ЧислоЧетное(Количество), Количество * 2 - 2, Количество * 2);
КонецФункции

Функция КоличествоФакт(Чемпионат) Экспорт
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Туры.Ссылка) КАК Количество
	      	               |ИЗ
	      	               |	Справочник.Туры КАК Туры
	      	               |ГДЕ
	      	               |	Туры.Владелец = &Чемпионат
	      	               |	И Туры.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Количество, 0);
КонецФункции
